OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1469/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.038842970452343 0 -7.121834174485383)
	(16.558264455678515 0 -7.121834174485383)
	(16.558264455678515 8.012063446296056 -7.121834174485383)
	(-11.038842970452343 8.012063446296056 -7.121834174485383)
	(-11.038842970452343 0 2.848733669794153)
	(16.558264455678515 0 2.848733669794153)
	(16.558264455678515 8.012063446296056 2.848733669794153)
	(-11.038842970452343 8.012063446296056 2.848733669794153)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (155 45 56) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

