OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1469/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       uniformDimensionedVectorField;
	location    constant;
	object      g;
}


dimensions    [0 1 -2 0 0 0 0];
value         (0 0 -9.810000);
