OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1469/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      k;
}

#include      "include/initialConditions";

dimensions    [0 2 -2 0 0 0 0];

internalField uniform $turbulentKE;

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	fixedValue;
		value	$internalField;
	}


	outlet
	{
		type	zeroGradient;
	}


	midPlane
	{
		type	symmetryPlane;
	}


	top
	{
		type	inletOutlet;
		inletValue	$internalField;
		value	$internalField;
	}


	hull
	{
		type	kLowReWallFunction;
		value	$internalField;
	}


	deck
	{
		type	kLowReWallFunction;
		value	$internalField;
	}


	rudder
	{
		type	kLowReWallFunction;
		value	$internalField;
	}

}
